In [24]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import confusion_matrix
from sklearn.metrics import classification_report
from sklearn.preprocessing import MinMaxScaler

In [19]:
df = pd.read_csv("teleCust1000t.csv")
df.head()

,region,tenure,age,marital,address,income,ed,employ,retire,gender,reside,custcat
0,2,13,44,1,9,64.0,4,5,0.0,0,2,1
1,3,11,33,1,7,136.0,5,5,0.0,0,6,4
2,3,68,52,1,24,116.0,1,29,0.0,1,2,3
3,2,33,33,0,12,33.0,2,0,0.0,1,1,1
4,2,23,30,1,9,30.0,1,2,0.0,0,4,3

In [20]:
for i in df:
    print(i,df[i].unique(),"\n")

region [2 3 1]

tenure [13 11 68 33 23 41 45 38  5  7 57  9 29 60 34  1 26  6 53 55 14 42 25 56
 71 35 20 54 44 72 10 15 27 64 65 49 47 30 52 36 58 69 28 16  3 40 48  8
 67  2 31 62  4 17 43 12 61 59 51 19 22 70 50 46 39 24 21 18 63 37 66 32]

age [44 33 52 30 39 22 35 59 41 38 54 46 57 48 24 29 43 21 40 37 53 50 27 60
 28 36 51 34 26 45 62 55 47 67 42 71 68 31 61 20 25 58 32 23 64 56 63 69
 65 66 19 76 70 49 75 72 74 77 18 73]

marital [1 0]

address [ 9  7 24 12 17  2  5 21 10 14  8 30  3 38 19 18  0 11  1  6 27 26 13 34
  4 20 28 36 16 15 22 44 29 23 31 25 49 41 39 43 33 32 35 40 37 45 48 42
 46 55]

income [  64.  136.  116.   33.   30.   78.   19.   76.  166.   72.  125.   80.
   37.  115.   25.   75.  162.   49.   20.   77.   16.  120.  101.   67.
   36.   31.   17.  155.  140.   55.  163.   52.  211.  186.   39.   22.
   29.   23.   62.   74.   63.   27.   24.   26.   47.   94.   21.  127.
  137.  438.   79.   40.   51.   61.   44.  110.   91.   46.   85.   10.
  244.   83.  351.  169.   34.   50.  161.  212.   53.   73.  107.  173.
   41.  105.  102.   68.   48.   28.  131.   18.   38.   60.   13.   98.
  195.   65.  150.  106.   96.  145.   99.   57.   56.  108.  242.  123.
   81.   86.   59.  112.  168.  167.  104.   43.   32.   58.   95.  114.
  128.  460.  224.  122.  191.  187.  119.   15.  674.  250.  200.   70.
  172.   45.   54.  142.   42.  134.   82.  153.  144.   35.  170.  183.
  318.    9.   14.  138.  359.  214.   88.  361.  335.  345.   93.   11.
  181.   87.  117.  508.  222.  130.  264.   71.   69.   90.   12.  146.
  928. 1668.  262.  209.   66.  118.  323.  197.  273.   92.  207.  203.
  380.  301.  271.  293.  189.  135.   97.  341.  121.  245.  456.  263.
  296.  232.  237.  151.  171.  294.  205.  732.  100.  147.  228.  129.
  311.  208.   89.  398.   84.  126.  591.  239.  248.  429.  608.  256.
  587.  113.  198. 1131.  360.  159.  201.  418.  152.  333.  288.  269.
  190.  944.]

ed [4 5 1 2 3]

employ [ 5 29  0  2 16  4 10 31 22 15  9 23  8  1 30  6  3 24 25 13 12 21 17 35
  7 20 19 18 34 11 47 14 38 28 26 41 27 44 37 33 40 32 43 36 39 45]

retire [0. 1.]

gender [0 1]

reside [2 6 1 4 5 3 7 8]

custcat [1 4 3 2]

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   region   1000 non-null   int64
 1   tenure   1000 non-null   int64
 2   age      1000 non-null   int64
 3   marital  1000 non-null   int64
 4   address  1000 non-null   int64
 5   income   1000 non-null   float64
 6   ed       1000 non-null   int64
 7   employ   1000 non-null   int64
 8   retire   1000 non-null   float64
 9   gender   1000 non-null   int64
 10  reside   1000 non-null   int64
 11  custcat  1000 non-null   int64
dtypes: float64(2), int64(10)
memory usage: 93.9 KB

In [22]:
df = pd.get_dummies(df, columns=['region'], prefix='region', drop_first=True)

In [23]:
df.head()

,tenure,age,marital,address,income,ed,employ,retire,gender,reside,custcat,region_2,region_3
0,13,44,1,9,64.0,4,5,0.0,0,2,1,1,0
1,11,33,1,7,136.0,5,5,0.0,0,6,4,0,1
2,68,52,1,24,116.0,1,29,0.0,1,2,3,0,1
3,33,33,0,12,33.0,2,0,0.0,1,1,1,1,0
4,23,30,1,9,30.0,1,2,0.0,0,4,3,1,0

In [27]:
columns_to_scale = ['tenure', 'age', 'address', 'income', 'ed', 'employ', 'reside']

scaler = MinMaxScaler()

df[columns_to_scale] = scaler.fit_transform(df[columns_to_scale])

In [28]:
df.head()

,tenure,age,marital,address,income,ed,employ,retire,gender,reside,custcat,region_2,region_3
0,0.169014,0.440678,1,0.163636,0.033153,0.75,0.106383,0.0,0,0.142857,1,1,0
1,0.140845,0.254237,1,0.127273,0.076552,1.00,0.106383,0.0,0,0.714286,4,0,1
2,0.943662,0.576271,1,0.436364,0.064497,0.00,0.617021,0.0,1,0.142857,3,0,1
3,0.450704,0.254237,0,0.218182,0.014467,0.25,0.000000,0.0,1,0.000000,1,1,0
4,0.309859,0.203390,1,0.163636,0.012658,0.00,0.042553,0.0,0,0.428571,3,1,0

In [29]:
X = df.drop(['custcat'], axis=1)
y = df.custcat

In [30]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1)

In [31]:
print(len(X_train), len(X_test))

800 200

In [32]:
knn = KNeighborsClassifier(n_neighbors=5)

In [33]:
knn.fit(X_train, y_train)

KNeighborsClassifier()

In [34]:
knn.score(X_test, y_test)

0.38